{
  "json_schema_major_version": "1",
  "json_schema_minor_version": "2",
  "json_content_version": "1",
  "function_name": "Sampling",
  "function_version": "1.5",
  "function_type": "non-driver",
  "function_alias_name": "Sampling",
  "function_r_name": "aa.sampling",
  "short_description": "Samples rows from an input table.",
  "long_description": "The Sampling function draws rows randomly from the input table. The function offers two sampling schemes: A simple Bernoulli (Binomial) sampling on a row-by-row basis with given sample rates Sampling without replacement that selects a given number of rows Sampling can be either unconditional or conditional. Unconditional sampling applies to all input data and always uses the same random number generator. Conditional sampling applies only to input data that meets specified conditions and uses a different random number generator for each condition.",
  "input_tables": [
    {
      "requiredInputKind": [
        "PartitionByAny",
        "PartitionByKey"
      ],
      "isOrdered": false,
      "partitionByOne": false,
      "name": "input",
      "alternateNames": [],
      "isRequired": true,
      "rDescription": "The table containing the data to be sampled.",
      "description": "The table containing the data to be sampled.",
      "datatype": "TABLE_ALIAS",
      "allowsLists": false,
      "rName": "data",
      "useInR": true,
      "rOrderNum": 1
    },
    {
      "requiredInputKind": [
        "Dimension"
      ],
      "isOrdered": false,
      "partitionByOne": false,
      "name": "SummaryTable",
      "alternateNames": [
        "summary"
      ],
      "isRequired": false,
      "rDescription": "The summary input contains the stratum count information.",
      "description": "The summary input contains the stratum count information.",
      "datatype": "TABLE_ALIAS",
      "allowsLists": false,
      "rName": "summary.data",
      "useInR": true,
      "rOrderNum": 2
    }
  ],
  "argument_clauses": [
    {
      "targetTable": [
        "input"
      ],
      "checkDuplicate": true,
      "allowedTypes": [],
      "allowedTypeGroups": [
        "GROUPTYPE"
      ],
      "requiredLength": 1,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "StratumColumn",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies the name of the column that contains the sample conditions. If the function has only one input table (the data table), then condition_column is in the data table. If the function has two input tables, data and summary, then condition_column is in the summary table.",
      "description": "[Required for conditional sampling, disallowed otherwise] Specify the name of the column that contains the sample conditions. If the function has only one input table (the data table), then stratum_column is in the data table. If the function has two input tables, data and summary, then stratum_column is in the summary table.",
      "datatype": "COLUMNS",
      "allowsLists": false,
      "rName": "stratum.column",
      "useInR": true,
      "rOrderNum": 3
    },
    {
      "lowerBound": 0,
      "upperBound": 1,
      "lowerBoundType": "INCLUSIVE",
      "upperBoundType": "INCLUSIVE",
      "allowNaN": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "SampleFraction",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies one or more fractions to use in sampling the data. (Syntax options that do not use sample.fraction require approx.sample.size.) If you specify only one fraction, then the function uses fraction for all strata defined by the sample conditions. If you specify more than one fraction, then the function uses each fraction for sampling a particular stratum defined by the condition arguments. Note: For conditional sampling with variable sample sizes, specify one fraction for each condition that you specify with the strata argument.",
      "description": "Specify one or more fractions to use in sampling the data. (Syntax options that do not use SampleFraction require ApproxSampleSize.) If you specify only one fraction , then the function uses fraction for all strata defined by the sample conditions. If you specify more than one fraction , then the function uses each fraction for sampling a particular stratum defined by the condition arguments. Note: For conditional sampling with variable sample sizes, specify one fraction for each condition that you specify with the Strata argument.",
      "datatype": "DOUBLE",
      "allowsLists": true,
      "rName": "sample.fraction",
      "useInR": true,
      "rOrderNum": 5
    },
    {
      "allowNaN": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "ApproxSampleSize",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies one or more approximate sample sizes to use in sampling the data. (Syntax options that do not use approx.sample.size require sample.fraction.) Each sample size is approximate because the function maps the size to the sample fractions and then generates the sample data. If you specify only one size, then it represents the total sample size for the entire population. If you also specify the strata argument, then the function proportionally generates sample units for each stratum. If you specify more than one size, then each size corresponds to a stratum, and the function uses each size to generate sample units for the corresponding stratum. Note: For conditional sampling with variable approximate sample sizes, specify one size for each condition that you specify with the strata argument.",
      "description": " Specify one or more approximate sample sizes to use in sampling the data. (Syntax options that do not use ApproxSampleSize require SampleFraction.) Each sample size is approximate because the function maps the size to the sample fractions and then creates the sample data. If you specify only one size, it represents the total sample size for the entire population. If you also specify the Strata argument, the function proportionally creates sample units for each stratum. If you specify more than one size , then each size corresponds to a stratum, and the function uses each size to create sample units for the corresponding stratum. Note: For conditional sampling with variable approximate sample sizes, specify one size for each condition that you specify with the Strata argument.",
      "datatype": "INTEGER",
      "allowsLists": true,
      "rName": "approx.sample.size",
      "useInR": true,
      "rOrderNum": 6
    },
    {
      "permittedValues": [],
      "isOutputColumn": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "Strata",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies the sample conditions that appear in the condition_column specified by stratum.column. If strata specifies a condition that does not appear in condition_column, then the function issues an error message.",
      "description": "[Required with StratumColumn.] Specify the sample conditions that appear in the stratum_column . If Strata specifies a condition that does not appear in stratum_column , the function issues an error message.",
      "datatype": "STRING",
      "allowsLists": true,
      "rName": "strata",
      "useInR": true,
      "rOrderNum": 4
    },
    {
      "lowerBound": -9223372036854775808,
      "upperBound": 9223372036854775807,
      "lowerBoundType": "INCLUSIVE",
      "upperBoundType": "INCLUSIVE",
      "allowNaN": false,
      "name": "Seed",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies the random seed used to initialize the algorithm.",
      "description": " Specify the random seed the algorithm uses for repeatable results. The seed must be a LONG value. Default: 0",
      "datatype": "LONG",
      "allowsLists": false,
      "rName": "seed",
      "useInR": true,
      "rOrderNum": 12
    },
    {
      "permittedValues": [],
      "isOutputColumn": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "UniqueId",
      "alternateNames": [
        "SequenceInputBy"
      ],
      "isRequired": false,
      "rDescription": "Specifies the LIST_VECTOR of column(s) that uniquely identifies each row of the input argument INPUT_ARG_NAME. The argument is used to ensure deterministic results for functions which produce results that vary from run to run.",
      "description": "Specifies the input column(s) that uniquely identify each row of input table. The format is 'input1:c1' where input1 refers to the alias used by the input table that contains such column named c1.",
      "datatype": "STRING",
      "allowsLists": true,
      "rName": "sequence.column",
      "useInR": true,
      "rOrderNum": 50
    }
  ]
}