{
  "json_schema_major_version": "1",
  "json_schema_minor_version": "2",
  "json_content_version": "1",
  "function_name": "Basket_Generator",
  "function_version": "1.6",
  "function_type": "non-driver",
  "function_alias_name": "BasketGenerator",
  "function_r_name": "aa.basket.generator",
  "short_description": "This function generates combinations of basket items  ",
  "long_description": "This function is a part of association analysis used for mining interesting baskets and also for trends over time and compare attributes",
  "input_tables": [
    {
      "requiredInputKind": [
        "PartitionByKey"
      ],
      "isOrdered": false,
      "partitionByOne": false,
      "name": "input",
      "alternateNames": [],
      "isRequired": true,
      "rDescription": "Input table that contains basket information.",
      "description": "Input table that contains basket information.",
      "datatype": "TABLE_ALIAS",
      "allowsLists": false,
      "rName": "data",
      "useInR": true,
      "rOrderNum": 1
    }
  ],
  "argument_clauses": [
    {
      "targetTable": [
        "input"
      ],
      "checkDuplicate": true,
      "allowedTypes": [],
      "allowedTypeGroups": [
        "ALL"
      ],
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "TargetColumns",
      "alternateNames": [
        "BasketItem"
      ],
      "isRequired": true,
      "rDescription": "Specifies the names of the input columns that contain the items to be collected into baskets. If you specify multiple columns, the function treats every unique combination of column values as one item. For example, you could specify only the column that contains the stock keeping unit (SKU) that identifies an item that was sold. Alternatively, you could specify the SKU column and the columns that contain the month manufactured, color and size.",
      "description": "Specify the names of the input columns that contain the items to collect into baskets. If you specify multiple columns, the function treats every unique combination of column values as one item. For example, you could specify only the column that contains the stock keeping unit (SKU) that identifies an item that was sold. Alternatively, you could specify the SKU column and the columns that contain the month manufactured, color and size.",
      "datatype": "COLUMNS",
      "allowsLists": true,
      "rName": " basket.item",
      "useInR": true,
      "rOrderNum": 2
    },
    {
      "targetTable": [
        "input"
      ],
      "checkDuplicate": true,
      "allowedTypes": [],
      "allowedTypeGroups": [
        "ALL"
      ],
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "Accumulate",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies the names of the input columns to copy to the output table. Each accumulate_column must be a partition_column; otherwise, the function is nondeterministic. However, not every partition_column must be an accumulate_column.",
      "description": " Specify the names of the input columns to copy to the output table. Each accumulate_column must be a partition_column ; otherwise, the function is nondeterministic (for more information, see Nondeterministic Results). However, not every partition_column must be an accumulate_column .",
      "datatype": "COLUMNS",
      "allowsLists": true,
      "rName": "accumulate",
      "useInR": true,
      "rOrderNum": 6
    },
    {
      "defaultValue": 2,
      "lowerBound": 2,
      "upperBound": 2147483647,
      "lowerBoundType": "INCLUSIVE",
      "upperBoundType": "INCLUSIVE",
      "allowNaN": false,
      "name": "BasketSize",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": " Specifies the number of items to be included in a basket (an INTEGER value). The default value is 2.",
      "description": " Specify the number of items to include in a basket (an INTEGER value). Default: 2",
      "datatype": "INTEGER",
      "allowsLists": false,
      "rName": "basket.size",
      "useInR": true,
      "rOrderNum": 3
    },
    {
      "defaultValue": 100,
      "lowerBound": 0,
      "upperBound": 2147483647,
      "lowerBoundType": "INCLUSIVE",
      "upperBoundType": "INCLUSIVE",
      "allowNaN": false,
      "name": "MaxPartitionSize",
      "alternateNames": [
        "MaxItems"
      ],
      "isRequired": false,
      "rDescription": "Specifies the maximum number of items in a partition (an INTEGER value). If the number of items in a partition exceeds item_set_max, then the function ignores that partition. The default value is 100.",
      "description": " Specify the maximum number of items in a partition (an INTEGER value). If the number of items in a partition exceeds max_partition_size , the function ignores that partition. Default: 100",
      "datatype": "INTEGER",
      "allowsLists": false,
      "rName": "max.items",
      "useInR": true,
      "rOrderNum": 4
    },
    {
      "defaultValue": true,
      "name": "OutputCombinations",
      "alternateNames": [
        "Combination"
      ],
      "isRequired": false,
      "rDescription": "Specifies whether the function returns a basket for each unique combination of items. The default value is 'true'. If you specify 'false', then the function returns a basket for each unique permutation of items. In a combination, item order is irrelevant. For example, the baskets \"tomatoes and basil\" and \"basil and tomatoes\" are equivalent. In a permutation, item order is relevant. For example, the baskets \"tomatoes and basil\" and \"basil and tomatoes\" are not equivalent. The function returns combinations and permutations in lexicographical order",
      "description": " Specify whether the function returns a basket for each unique combination of items. If you specify 'false', the function returns a basket for each unique permutation of items. In a combination, item order is irrelevant. For example, the baskets \"tomatoes and basil\" and \"basil and tomatoes\" are equivalent. In a permutation, item order is relevant. For example, the baskets \"tomatoes and basil\" and \"basil and tomatoes\" are not equivalent. The function returns combinations and permutations in lexicographical order. If n is the number of distinct items that can appear in a basket and r is basket_size , then: The maximum number of combinations is: n C r or n !/( r !( n - r )!) The maximum number of permutations is: n P r or n !/( n - r )!) If the number of combinations or permutations exceeds one million, the function outputs no rows. Default: 'true'",
      "datatype": "BOOLEAN",
      "allowsLists": false,
      "rName": "combination",
      "useInR": true,
      "rOrderNum": 5
    },
    {
      "permittedValues": [],
      "isOutputColumn": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "SequenceInputBy",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies the LIST_VECTOR of column(s) that uniquely identifies each row of the input argument INPUT_ARG_NAME. The argument is used to ensure deterministic results for functions which produce results that vary from run to run.",
      "description": "Specifies the input column(s) that uniquely identify each row of input table. The format is 'input1:c1' where input1 refers to the alias used by the input table that contains such column named c1.",
      "datatype": "STRING",
      "allowsLists": true,
      "rName": "sequence.column",
      "useInR": true,
      "rOrderNum": 50
    }
  ]
}