{
  "json_schema_major_version": "1",
  "json_schema_minor_version": "2",
  "json_content_version": "1",
  "function_name": "PartitionScale",
  "function_version": "1.6",
  "function_type": "non-driver",
  "function_alias_name": "ScaleByPartition",
  "function_r_name": "aa.partition.scale",
  "short_description": "This function scales the input to a specified range.",
  "long_description": "This function scales the input to a specified range based on the values in each partition.",
  "input_tables": [
    {
      "requiredInputKind": [
        "PartitionByKey"
      ],
      "isOrdered": false,
      "partitionByOne": false,
      "name": "input",
      "alternateNames": [],
      "isRequired": true,
      "rDescription": "The input dataset for scale function.",
      "description": "The input dataset for scale function.",
      "datatype": "TABLE_ALIAS",
      "allowsLists": false,
      "rName": "data",
      "useInR": true,
      "rOrderNum": 1
    }
  ],
  "argument_clauses": [
    {
      "targetTable": [
        "input"
      ],
      "checkDuplicate": true,
      "allowedTypes": [],
      "allowedTypeGroups": [
        "NUMERIC"
      ],
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "TargetColumns",
      "alternateNames": [
        "InputColumns"
      ],
      "isRequired": true,
      "rDescription": "Specifies the input table columns that contain the attribute values of the samples. The attribute values must be numeric values between -1e308 and 1e308. If a value is outside this range, the function treats it as infinity.",
      "description": "Specify the input table columns that contain the values to scale. The columns must contain numeric values must between -1e 308 and 1e 308 . If a value is outside this range, the function treats it as infinity.",
      "datatype": "COLUMNS",
      "allowsLists": true,
      "rName": "input.columns",
      "useInR": true,
      "rOrderNum": 4
    },
    {
      "targetTable": [
        "input"
      ],
      "checkDuplicate": true,
      "allowedTypes": [],
      "allowedTypeGroups": [
        "ALL"
      ],
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "Accumulate",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies the input table columns to copy to the output table. By default, the function copies no input table columns to the output table. Tip: To identify the sequences in the output, specify the partition columns in this argument.",
      "description": " Specify the input table columns to copy to the output table. Tip: To identify the sequences in the output, specify the partition columns in this argument.",
      "datatype": "COLUMNS",
      "allowsLists": true,
      "rName": "accumulate",
      "useInR": true,
      "rOrderNum": 6
    },
    {
      "permittedValues": [
        "MEAN",
        "SUM",
        "USTD",
        "STD",
        "RANGE",
        "MIDRANGE",
        "MAXABS"
      ],
      "isOutputColumn": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "ScaleMethod",
      "alternateNames": [
        "Method"
      ],
      "isRequired": true,
      "rDescription": "Specifies one or more statistical methods to use to scale the data set. For method values and descriptions. If you specify multiple methods, the output table includes the column scalemethod (which contains the method name) and a row for each input-row/method combination",
      "description": "Specify one or more statistical methods to use to scale the data set. For method values and descriptions, see Location and Scale for Statistical Methods. If you specify multiple methods, the output table includes the column scalemethod (which contains the method name) and a row for each input-row/method combination.",
      "datatype": "STRING",
      "allowsLists": true,
      "rName": "method",
      "useInR": true,
      "rOrderNum": 2
    },
    {
      "permittedValues": [
        "KEEP",
        "OMIT",
        "ZERO",
        "LOCATION"
      ],
      "defaultValue": "KEEP",
      "isOutputColumn": false,
      "name": "MissValue",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies how the ta.partitionscale function is to process NULL values in input, as follows: KEEP (default): Keep NULL values, OMIT: Ignore any row that has a NULL value, ZERO: Replace each NULL value with zero, LOCATION: Replace each NULL value with its location value.",
      "description": " Specify how the ScaleByPartition function is to process NULL values in input: Option Description KEEP (Default) Keep NULL values. OMIT Ignore any row that has a NULL value. ZERO Replace each NULL value with zero. LOCATION Replace each NULL value with its location value.",
      "datatype": "STRING",
      "allowsLists": false,
      "rName": "miss.value",
      "useInR": true,
      "rOrderNum": 3
    },
    {
      "defaultValue": false,
      "name": "GlobalScale",
      "alternateNames": [
        "Global"
      ],
      "isRequired": false,
      "rDescription": " Specifies whether all input columns are scaled to the same location and scale. The default value is 'false' (each input column is scaled separately). ",
      "description": " Specify whether all input columns are scaled to the same location and scale. Default: 'false' (Each input column is scaled separately.)",
      "datatype": "BOOLEAN",
      "allowsLists": false,
      "rName": "global",
      "useInR": true,
      "rOrderNum": 5
    },
    {
      "defaultValue": [
        1
      ],
      "allowNaN": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "Multiplier",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies one or more multiplying factors to apply to the input variables (multiplier in the following formula): X' = intercept + multiplier * (X - location)/scale If you specify only one multiplier, it applies to all columns specified by the input.columns argument. If you specify multiple multiplying factor, each multiplier applies to the corresponding input column. For example, the first multiplier applies to the first column specified by the InputColumns argument, the second multiplier applies to the second input column, and so on. The default multiplier is 1. ",
      "description": " Specify one or more multiplying factors to apply to the input variables ( multiplier in this formula): X' = intercept + multiplier * ( X - location )/ scale If you specify only one multiplier , it applies to all columns specified by the TargetColumns argument. If you specify multiple multiplying factors, each multiplier applies to the corresponding input column. For example, the first multiplier applies to the first column specified by the TargetColumns argument, the second multiplier applies to the second input column, and so on. Default: multiplier is 1.",
      "datatype": "DOUBLE",
      "allowsLists": true,
      "rName": "multiplier",
      "useInR": true,
      "rOrderNum": 7
    },
    {
      "permittedValues": [],
      "defaultValue": [
        "0"
      ],
      "isOutputColumn": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "Intercept",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies one or more addition factors incrementing the scaled results—intercept in the following formula: X' = intercept + multiplier * (X - location)/scale If you specify only one intercept, it applies to all columns specified by the input.columns argument. If you specify multiple addition factors, each intercept applies to the corresponding input column. The syntax of intercept is: [-]{number | min | mean | max } where min, mean, and max are the global minimum, maximum, mean values in the corresponding columns. The function scales the values of min, mean, and max. For example, if intercept is '- min' and multiplier is 1, the scaled result is transformed to a nonnegative sequence according to this formula, where scaledmin is the scaled value: X' = -scaledmin + 1 * (X - location)/scale The default intercept is 0.",
      "description": " Specify one or more addition factors incrementing the scaled results— intercept in this formula: X' = intercept + multiplier * ( X - location )/ scale If you specify only one intercept , it applies to all columns specified by the TargetColumns argument. If you specify multiple addition factors, each intercept applies to the corresponding input column. This is the syntax of intercept : number | min | mean | max } where min , mean , and max are the scaled global minimum, maximum, mean values of the corresponding columns. This is the formula for computing the scaled global minimum: scaledmin = (minX - location )/ scale The formulas for computing the scaled global mean and maximum are analogous to the preceding formula. For example, if intercept is '- min' and multiplier is 1, this is the formula for computing the scaled result X': X' = - scaledmin + 1 * (X - location / scale ) Default: intercept is 0.",
      "datatype": "STRING",
      "allowsLists": true,
      "rName": "intercept",
      "useInR": true,
      "rOrderNum": 8
    },
    {
      "permittedValues": [],
      "isOutputColumn": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "SequenceInputBy",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies the LIST_VECTOR of column(s) that uniquely identifies each row of the input argument INPUT_ARG_NAME. The argument is used to ensure deterministic results for functions which produce results that vary from run to run.",
      "description": "Specifies the input column(s) that uniquely identify each row of input table. The format is 'input1:c1' where input1 refers to the alias used by the input table that contains such column named c1.",
      "datatype": "STRING",
      "allowsLists": true,
      "rName": "sequence.column",
      "useInR": true,
      "rOrderNum": 50
    }
  ]
}