{
  "json_schema_major_version": "1",
  "json_schema_minor_version": "2",
  "json_content_version": "1",
  "function_name": "StringSimilarity",
  "function_version": "1.2",
  "function_type": "non-driver",
  "function_alias_name": "StringSimilarity",
  "function_r_name": "aa.string.similarity",
  "short_description": "SQL/MR function to compare 2 strings.",
  "long_description": "The StringSimilarity function calculates the similarity between two strings, using either the Jaro, Jaro-Winkler, N-Gram, or Levenshtein distance. The similarity is a value in the range [0, 1].",
  "input_tables": [
    {
      "requiredInputKind": [
        "PartitionByAny"
      ],
      "isOrdered": false,
      "partitionByOne": false,
      "name": "input",
      "alternateNames": [],
      "isRequired": true,
      "rDescription": "The relation that contains the string pairs to be compared.",
      "description": "The relation that contains the string pairs to be compared.",
      "datatype": "TABLE_ALIAS",
      "allowsLists": false,
      "rName": "data",
      "useInR": true,
      "rOrderNum": 1
    }
  ],
  "argument_clauses": [
    {
      "targetTable": [
        "input"
      ],
      "checkDuplicate": true,
      "allowedTypes": [],
      "allowedTypeGroups": [
        "ALL"
      ],
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "Accumulate",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies the names of input table columns to be copied to the output table",
      "description": " Specify the names of input table columns to copy to the output table.",
      "datatype": "COLUMNS",
      "allowsLists": true,
      "rName": "accumulate",
      "useInR": true,
      "rOrderNum": 4
    },
    {
      "permittedValues": [],
      "isOutputColumn": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "ComparisonColumnPairs",
      "alternateNames": [],
      "isRequired": true,
      "rDescription": "Specifies pairs of input table columns that contain strings to be compared (column1 and column2), how to compare them (comparison_type), and (optionally) a constant and the name of the output column for their similarity (output_column). The similarity is a value in the range [0, 1]. For comparison_type, use one of these values:  'jaro': Jaro distance,  'jaro_winkler': Jaro-Winkler distance (1 for an exact match, 0 otherwise),  'n-gram': N-gram similarity. If you specify this comparison type, you can specify the value of N with constant.  'LD': Levenshtein distance (the number of edits needed to transform one string into the other, where edits include insertions, deletions, or substitutions of individual characters) You can specify a different comparison_type for every pair of columns. The default output_column is 'sim_i', where i is the sequence number of the column pair.",
      "description": "Specify pairs of input table columns that contain strings to compare ( column1 and column2 ), how to compare them ( comparison_type ), and (optionally) a constant and the name of the output column for their similarity ( output_column ). The similarity is a value in the range [0, 1]. For comparison_type , use one of these values: comparison_type Description 'jaro' Jaro distance. 'jaro_winkler' Jaro-Winkler distance: 1 for an exact match, 0 otherwise. 'n-gram' N -gram similarity. If you specify this comparison type, you can specify the value of N with constant . Default: N = 2 'LD' Levenshtein distance: Number of edits needed to transform one string into the other. Edits are insertions, deletions, or substitutions of individual characters. You can specify a different comparison_type for every pair of columns. Default: output_column is 'sim_ i ', where i is the sequence number of the column pair.",
      "datatype": "STRING",
      "allowsLists": true,
      "rName": "comparison.columns",
      "useInR": true,
      "rOrderNum": 2
    },
    {
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "Casesensitive",
      "alternateNames": [],
      "isRequired": false,
      "rDescription": "Specifies whether string comparison is case-sensitive. The default value is 'false'. You can specify either one value for all pairs or one value for each pair. If you specify one value for each pair, then the ith value applies to the ith pair.",
      "description": " Specify whether string comparison is case-sensitive. You can specify either one value for all pairs or one value for each pair. If you specify one value for each pair, the i th value applies to the i th pair. Default: 'false'",
      "datatype": "BOOLEAN",
      "allowsLists": true,
      "rName": "case.sensitive",
      "useInR": true,
      "rOrderNum": 3
    },
    {
      "permittedValues": [],
      "isOutputColumn": false,
      "matchLengthOfArgument": "",
      "allowPadding": true,
      "name": "UniqueId",
      "alternateNames": [
        "SequenceInputBy"
      ],
      "isRequired": false,
      "rDescription": "Specifies the LIST_VECTOR of column(s) that uniquely identifies each row of the input argument INPUT_ARG_NAME. The argument is used to ensure deterministic results for functions which produce results that vary from run to run.",
      "description": "Specifies the input column(s) that uniquely identify each row of input table. The format is 'input1:c1' where input1 refers to the alias used by the input table that contains such column named c1.",
      "datatype": "STRING",
      "allowsLists": true,
      "rName": "sequence.column",
      "useInR": true,
      "rOrderNum": 50
    }
  ]
}